/***********************************************************************
 * XG SERVER
 * core/filecache.h
 * Хэш таблица
 * 
 * Copyright (с) 2014-2015 Stanislav V. Tretyakov, svtrostov@yandex.ru
 **********************************************************************/   



#ifndef _XGFILECACHE_H
#define _XGFILECACHE_H

#ifdef __cplusplus
extern "C" {
#endif


/***********************************************************************
 * Подключаемые заголовки
 **********************************************************************/

#include "core.h"
#include "kv.h"
#include "server.h"



/***********************************************************************
 * Константы
 **********************************************************************/

//Максимальный размер файлов, добавляемых в кеш (значение по-умолчанию)
static const uint32_t cache_default_max_file_size = 1024 * 1024;

//Максимальное количество файлов в кеше (значение по-умолчанию)
static const uint32_t cache_default_max_file_count = 128;






/***********************************************************************
 * Объявления и декларации
 **********************************************************************/





/***********************************************************************
 * Структуры
 **********************************************************************/



//Структура настроек кеша файлов
typedef struct{
	kv_s		* cache;			//Кеш файлов
	uint32_t	max_filesize;		//Максимальный размер файла, который может быть в кэше
	uint32_t	cache_limit;		//Максимальное количество файлов, которые могут быть в кэше
	uint32_t	cache_count;		//Текущее количество файлов в кеше
} filecache_s;



/***********************************************************************
 * Функции
 **********************************************************************/


void					filecacheInit(void);	//Инициализация кеша файлов
static_file_s *			filecacheGet(static_file_s * sf);	//Возвращает файл из кеша, если файла в кеше нет - добавляет его в кеш, или возвращает NULL, если по каким-либо причинам не удалось добавить файл в кеш




#ifdef __cplusplus
}
#endif

#endif //_XGFILECACHE_H
